[
  {
    "title": "Portfolio",
    "year": {
      "from": "0"
    },
    "smallDescription": "Simply my portfolio, with other things that happen on the site without being in real connection with a portfolio because I want to learn more about the Web and in general",
    "description": "At the beginning I created this portfolio to show my different projects, and learn at the same time Svelte and CSS in general because I use very often Bootstrap but I'm not autonomous enough (to make myself the CSS) so I decided to do it myself, well I confess I was a bit forced by someone but 😨 in the end I don't regret.<br><br>And by making this site I quickly realized that I can push even further, so I really intend to push further this repository by making for example to train me a blog with comments for example,<br><br>Everything that can make me learn things I intend to do even if it goes out of the context of a portfolio, I will rename the other pages and I will leave the default page under the name of \"Portfolio\".",
    "primaryTechIcon": "/icons/techs/svelte.png",
    "techIcons": [
      "/icons/techs/typescript.png", 
      "/icons/techs/javascript.png", 
      "/icons/techs/html.png", 
      "/icons/techs/css.png", 
      "/icons/techs/sass.png",
      "/icons/techs/firebase.png",
      "/icons/techs/vercel.svg"
    ],
    "buttons": [
      {
        "text": "GitHub",
        "link": "https://github.com/Steellgold/Portfolio",
        "icon": "dark/GitHub.png"
      },
      {
        "text": "Figma",
        "link": "https://www.figma.com/file/FFj5HB04eYnIOpWNCns1k9/Portfolio?node-id=41%3A2",
        "icon": "techs/figma.png"
      }
    ],
    "contributors": [
      "Bluzzi"
    ]
  },
  {
    "title": "Vendit",
    "year": {
      "from": "2022"
    },
    "smallDescription": "Site where you can sell PocketMine-MP plugins, <b>the site is undergoing a graphic redesign</b>"",
    "description": "On this site you can buy or sell Minecraft plugins on the PocketMine-MP API, you can also in the future (for sellers) use an API that will indicate if the plugin has been purchased or if it is a leak<br><br>Deployed with Railway",
    "primaryTechIcon": "/icons/techs/svelte.png",
    "techIcons": [
      "/icons/techs/typescript.png", 
      "/icons/techs/javascript.png", 
      "/icons/techs/html.png", 
      "/icons/techs/css.png", 
      "/icons/techs/sass.png",
      "/icons/techs/railway.png"
    ],
    "button": {
      "text": "Website (old)",
      "link": "https://github.com/Steellgold/Rox",
      "icon": "dark/GitHub.png"
    }
  },
  {
    "title": "ActuCroûtons",
    "year": {
      "from": "0"
    },
    "smallDescription": "I develop the website of the information media dedicated to the Crouton Team, the website work in progress",
    "description": "This is a site that will allow maintainers to post information, new videos and other topics about Team Crouton<br><br>Deployed with Railway",
    "banner": "https://media.discordapp.net/attachments/1031293529546305658/1031294348899405824/unknown.png?width=568&height=804",
    "primaryTechIcon": "/icons/techs/svelte.png",
    "techIcons": [
      "/icons/techs/typescript.png", 
      "/icons/techs/javascript.png", 
      "/icons/techs/html.png", 
      "/icons/techs/css.png", 
      "/icons/techs/sass.png",
      "/icons/techs/vercel.png"
    ],
    "buttons": [
      {
        "text": "Website",
        "link": "https://actuscroutons.steellgold.fr/"
      },
      {
        "text": "Instagram",
        "link": "https://www.instagram.com/actucroutons/",
        "icon": "dark/Instagram.png"
      }
    ]
  },
  {
    "title": "Lunastia",
    "year": {
      "from": "2022"
    },
    "smallDescription": "A Minecraft server based on the SkyBlock with a rewriting of the concept by adding new ways to play, or systems invented from scratch to bring a new side to the game.",
    "description": "This server has a funny beginning, on a Discord server someone was looking for a developer for a Java server and so I didn't want to introduce myself because obviously I've never done it, but I was really advised to do it because it was a good experience to know different languages and even to do something else than PHP<br><br>So I said OK, a few days after I started to work I was informed about a bad news so I put on pause and I went back to my job, and a few days later my friend came and proposed me to make a java server.<br><br>For fun I said yes because it was supposed to be private for the two of us to play, and the craziness went too far which brings us to today, to make it a real server as people we know or not joined the project, and we will say that the project has a good potential due to the huge number of pages on the specifications for the server.<br><br>Here is the project, a Minecraft server <b>Java</b> Edition modifying largely the style of game or implementing new systems on the known name: \"SkyBlock\".",
    "banner": "https://media.discordapp.net/attachments/580083630995537961/1011656732579205151/image_2_1.png",
    "primaryTechIcon": "/icons/techs/java.png",
    "techIcons": [
      "/icons/techs/spigot.png",
      "/icons/techs/maven.png"
    ],
    "button": {
      "text": "Discord",
      "link": "https://discord.com/",
      "icon": "dark/Discord.png"
    },
    "people": [
      "Steellgold",
      "Pralexkid",
      "Zaelee",
      "LeKiMi"
    ],
    "contributors": [
      "KingDeadKnight",
      "Arcoz0308"
    ]
  },
  {
    "title": "RoyaumeBot",
    "year": {
      "from": "2022"
    },
    "smallDescription": "It is the bot of our Discord community, it offers various utility features. It is written in TypeScript and uses the DiscordJS package to interact with the Discord API.",
    "description": "Le Royaume is a private French community (filtered entry) on the Discord platform, whose goal is to help each other, discuss and debate about development, graphics and business.<br><br>The projects on the GitHub organization are either private or public, for a very long time the bot itself was private but has now become public, which means that anyone can participate by proposing modifications, additions of features or even install it on their own server, the real purpose of it being public is the fact of showing the general public WHO is working on it for students, developers looking for a job for example that they can show that they have participated in a project <b>open-source<b>.",
    "primaryTechIcon": "/icons/techs/typescript.png",
    "techIcons": [
      "/icons/techs/nodejs.png",
      "/icons/techs/discordjs.png"
    ],
    "button": {
      "text": "GitHub",
      "link": "https://github.com/Virtual-Royaume/Royaume-Discord-Bot",
      "icon": "dark/GitHub.png"
    },
    "people": [
      "Bluzzi",
      "Steellgold",
      "Verre2OuiSki",
      "RomainSav",
      "Se7en-dev",
      "JedXDs",
      "Asplix",
      "LMGerard",
      "shaynlink",
      "RtoxGaming",
      "scdying"
    ],
    "banner": "https://cdn.discordapp.com/attachments/927843710669062204/1011679980566097951/Group_2.png"
  },
  {
    "title": "Rox",
    "year": {
      "from": "2022"
    },
    "smallDescription": "A bot initially developed by me alone in JavaScript without having concrete knowledge.",
    "description": "Robot Discord in JavaScript with more than <b>100k users</b>, project abandoned in 2020 but rebooted in May 2022 with RomainSav, since I'm a developer especially in PHP, I rarely leave this comfort zone, Rox is one of my \"desires\" to get out and learn new things, especially after the stop of the bot I had no desire to touch JavaScript, but RomainSav gave me back the desire, because he knows more than me, so I followed him to redesign the project but better! and in TypeScript this time 😉",
    "primaryTechIcon": "/icons/techs/typescript.png",
    "techIcons": [
      "/icons/techs/nodejs.png",
      "/icons/techs/discordjs.png"
    ],
    "button": {
      "text": "GitHub (old)",
      "link": "https://github.com/Steellgold/Rox",
      "icon": "dark/GitHub.png"
    },
    "contributors": [
      "RomainSav"
    ],
    "banner": "https://cdn.discordapp.com/attachments/739077279551848460/744955903156944946/unknown.png"
  },
  {
    "title": "Atlas",
    "year": {
      "from": "2019",
      "to": "2020"
    },
    "smallDescription": "A server with <b>4100+ unique players</b> (at the time of my departure). I developed the whole first version as well as the pre-release which was under another name (RivalityShock PvP) which lasted 4 months (from the moment I arrived), this is where I was able to use my knowledge of PocketMine-MP and get to where I am now.",
    "description": "Minecraft Bedrock Edition practice server with different game modes, developers during all its first version! i owe everything to this project, as well as to the person who invited me. At the beginning I was only supposed to be a developer during a party to help! and I was quickly invited as a developer, and 1 week almost just after manager, having carte-blanche to manage the server which became several big, the code does not reflect the quality of the server, the code is disgusting for sure, but everything has a beginning, and. . an end, this project was my very first big project for 1 year at least I developed a server, I played on it, I added what I liked to make it like other people. It was a crazy experience that taught me things I wouldn't have known today without Atlas. Thanks Calco for trusting me, and thanks Red for the invitation!",
    "primaryTechIcon": "/icons/techs/php.png",
    "techIcons": [
      "/icons/techs/pmmp.png"
    ],
    "button": {
      "text": "GitHub",
      "link": "https://github.com/Steellgold/AtlasCore",
      "icon": "dark/GitHub.png"
    }
  }
]
